Autodesk.Revit.DB.EaveCutterType
An enumerated type to store type of EaveCutter.

Autodesk.Revit.DB.EaveCutterType.TwoCutSquare
Two Cut Square type of Eave.

Autodesk.Revit.DB.EaveCutterType.TwoCutPlumb
Two Cut Plumb type of Eave.

Autodesk.Revit.DB.EaveCutterType.PlumbCut
Plumb Cut type of Eave.